---
kind: method
id: M:Autodesk.Revit.DB.DoubleArray.ReverseIterator
source: html/745cc397-1fdf-629e-3f89-c1d16519d327.htm
---
# Autodesk.Revit.DB.DoubleArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual DoubleArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.